library(quantmod)
library(magrittr)
library(xts)
# Прочитайте файл Futures.rds он содержит фьючерсы на USD/RUB с датами исполнения c 2011 года по 2018 год.
# Сделать это можно с помощью readRDS.
# Тикеты состоят из 3 частей Si + Z,H,M,U месяц исполнения (H - Март, M - Июнь, U - Сентябрь, Z - Декабрь) + цифра идентификатор года.
# Например дата исполнения фьючерса SiZ9 декабрь 2019 года.


Futures <- readRDS("Futures.rds")
# Необходимо склеить фьючерсы в предпоследний день их существования с помощью метода умножения
# Для этого необходимо создать функцию, которая принимает на вход два xts объекта и склеивает их в соответствии с нашим правилом

mult <- function(x,y){
  ...
}

# Для объединения всех фьючерсов нужно воспользоваться функцией Reduce
adjusted_futures <- Reduce(mult, Futures)
plot(adjusted_futures)

saveRDS(adjusted_futures, 'adjusted_futures.RDS')
